; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph1 - mode
	thermograph2 - mode
	image3 - mode
	infrared4 - mode
	infrared0 - mode
	thermograph5 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation5 - direction
	Star2 - direction
	GroundStation9 - direction
	GroundStation13 - direction
	Star10 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument1 image3)
	(supports instrument1 thermograph5)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(have_image Planet14 infrared0)
	(have_image Planet14 image3)
	(have_image Phenomenon15 image3)
	(have_image Planet16 image3)
	(have_image Phenomenon17 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 phenomenon15 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 5
3. (turn_to satellite0 star2 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon15 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 5
6. (take_image satellite0 phenomenon15 instrument0 image3)
   added: (have_image phenomenon15 image3)
   goals met: 1 of 5
7. (turn_to satellite0 phenomenon17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 5
8. (take_image satellite0 phenomenon17 instrument0 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 2 of 5
9. (turn_to satellite0 planet14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet14)
   goals met: 2 of 5
10. (take_image satellite0 planet14 instrument0 image3)
   added: (have_image planet14 image3)
   goals met: 3 of 5
11. (take_image satellite0 planet14 instrument0 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 4 of 5
12. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 4 of 5
13. (take_image satellite0 planet16 instrument0 image3)
   added: (have_image planet16 image3)
   goals met: 5 of 5
